ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32Arduino_WordClockV069/ESP32Arduino_WordClockV069.ino
/* 
 Author      : Ed Nieuwenhuys ednieuw.nl
 Changes V001: Derived from ESP32C3S3_WordClockV026.ino
 Changes V003: Clock and SK6812 LEDstrip working
...
 Changes V050: Only first 10 LEDs light up at startup instead of whole LED-string
 Changes V051: Moved In Setup() InitStorage() just after serial started. Setting were read too late  
 Changes V052: Violet startup Progress LEDs added
 Changes V053: Minors
 Changes V053: BLE delay(40) -> 10
 Changes V055: Fine tuned WIFIwasConnected. Minor changes 
               Identical common routines ESP32ArduinoFibonacci_V003 / ESP32WordClockUltimatePCB_V028 / ESP32WordClockV055
 Changes V056: MDNS.begin(BLEbroadcastName). Added  </style> in line 22 of webpage.h. Option Q3 and Q4 were reversed and corrected
 Changes V057: New design NLM1M2M3M4L94 --> NLM1M2M3M4L114
 Changes V058: Removed WhiteColour and --> white. void Laatzien(int Delaymsec). Last used Color in digital display. WIFI custom name in router
 Changes V059: Added KEYPAD3x1
 Changes V060: NimBLE version 1.4.3 -> 2.1.2 upgrade:
                void onConnect(BLEServer* pServer) {deviceConnected = true; };
                void onDisconnect(BLEServer* pServer) {deviceConnected = false;}
                void onWrite(BLECharacteristic *pCharacteristic) 
                To:
                void onConnect(NimBLEServer* pServer, NimBLEConnInfo& connInfo) override {deviceConnected = true;Serial.println("Connected" ); };
                void onDisconnect(NimBLEServer* pServer, NimBLEConnInfo& connInfo, int reason) override {deviceConnected = false;Serial.println("NOT Connected" );}
                void onWrite(NimBLECharacteristic *pCharacteristic, NimBLEConnInfo& connInfo) override  
                added: pAdvertising->setName(BLEbroadcastName);   after pAdvertising->addServiceUUID(SERVICE_UUID); 
 Changes V061: Added  NLM1M2M3M4L256. Added DS3231 OnOff in menu.
 Changes V062: Selftest(msec). NTP library https://github.com/gmag11/ESPNtpClient crashes with core 3.1.0
               R reset does not erase SSID, PWD and BLEstation but command RRR does erase SSID, PWD and BLEstation
               Removed extra CR, LF etc in ReworkInputString
 Changes V063: Removed WiFiGotIP() and to_upper()
 Changes V064: Added WIFI router credentials login page  
 Changes V065: Added Dynamic menu web page. Removed //sptext[0]=0 from tekstprint() . 
 Changes V066: Cleaning code  
 Changes V067: Stable
 Changes V068: Fancier web page. Documentation updated. RRR en RRRRR option for reset 
 Changes V069: Added Mem.WIFIcredentials to test if the SSID/PWD were set in AP-mode but were wrong. 
               After ESP32 restart the StartWordclock WIFI station will be restarted.
               Wire.begin(); // Keep Wire.begin close to the first I2C start to avoid WireTimeout()

//ToDo
- implement ChangeNTP_RTC
- Port to ESP32 V3.1.0
- Check SK6812 on V3.1. Flickers in 3.0.7
- Replace? NimBLE https://docs.espressif.com/projects/arduino-esp32/en/latest/api/ble.html
- 

How to compile: 

Check if ELEGANTOTA_USE_ASYNC_WEBSERVER 1 in ElegantOTA.h stored in the libraries folder
// Locate the ELEGANTOTA_USE_ASYNC_WEBSERVER macro in the ElegantOTA.h file, and set it to 1:
// #define ELEGANTOTA_USE_ASYNC_WEBSERVER 1


Install ESP32 boards
Board: Arduino Nano ESP32
Partition Scheme: With FAT
Pin Numbering: By GPIO number (legacy). Not  By Arduino pin (default)
Select below, with only one #define selected, the clock type

*/
// =============================================================================================================================
// ------------------>   Define only one clock type
//#define FOURLANGUAGECLOCK
#define NL144CLOCK
//#define NLM1M2M3M4L114          // NL clock with four extra LEDs for the minutes to light up
//#define NLM1M2M3M4L256          // NL clock with four extra LEDs for the minutes to light up
//#define NLM1M2M3M4L144          // NL clock with four extra LEDs for the minutes to light up 
//--------------------------------------------
// ESP32 Definition of installed modules
// Define the modules installed in the clock by removing the // before the #define
//--------------------------------------------
//#define ONEWIREKEYPAD3x1       // Use a 3x1 keypad with one wire
//#define ONEWIREKEYPAD3x4       // Use a 3x4 keypad with one wire
//--------------------------------------------
// ESP32 Includes defines and initialisations
//--------------------------------------------

#include <Preferences.h>
                      #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
#include <EdSoftLED.h>         // https://github.com/ednieuw/EdSoftLED for LED strip WS2812 or SK6812 
                      #else
#include <Adafruit_NeoPixel.h> // https://github.com/adafruit/Adafruit_NeoPixel   for LED strip WS2812 or SK6812
                      #endif
#include <NimBLEDevice.h>      // For BLE communication. !!!Use NimBLE version 2.x.x  https://github.com/h2zero/NimBLE-Arduino
#include <ESPNtpClient.h>      // https://github.com/gmag11/ESPNtpClient
#include <WiFi.h>              // Used for web page 
#include <AsyncTCP.h>          // Used for webpage  https://github.com/dvarrel/AsyncTCP                    old https://github.com/me-no-dev/ESPAsyncWebServer
#include <ESPAsyncWebServer.h> // Used for webpage  https://github.com/mathieucarbou/ESPAsyncWebServer     Old original one https://github.com/me-no-dev/ESPAsyncWebServer
#include <ElegantOTA.h>        // If a large bunch of compile error see here :https://docs.elegantota.pro/async-mode
                               // Locate the ELEGANTOTA_USE_ASYNC_WEBSERVER macro in the ElegantOTA.h file, and set it to 1:
                               // #define ELEGANTOTA_USE_ASYNC_WEBSERVER 1
#include <ESPmDNS.h>           // To show BLEname in router
#include <DNSServer.h>         // For the web page to enter SSID and password of the WIFI router 
#include <Wire.h>              // Ter zijner tijd Wire functies gaan gebruiken. Staan al klaar in de code 
#include <RTClib.h>            // Used for connected DS3231 RTC // Reference https://adafruit.github.io/RTClib/html/class_r_t_c___d_s3231.html
#include <Encoder.h>           // For rotary encoder
#include <Keypad.h>            // For 3x1 membrane keypad instead of rotary encoder by Mark Stanley & Alexander Brevig 


//------------------------------------------------------------------------------
// ARDUINO Definition of installed language word clock
//------------------------------------------------------------------------------
                     #ifdef FOURLANGUAGECLOCK
#define NL
#define UK
#define DE
#define FR    
                     #endif //FOURLANGUAGECLOCK

                     #ifdef NL144CLOCK
const uint32_t NUM_LEDS  =  144;                                      // How many leds in  strip? + 4 for the minutes
const byte MATRIX_WIDTH  =  12;                                       // Grid size For digital display mode.  
const byte MATRIX_HEIGHT =  12;                                       // Grid size For digital display mode.
// const uint32_t NUM_LEDS  =  256;   // Temporary for 16x16LED WS2812. To clear all LEDs. During uploading LEDs get randomly On and Off
// const byte MATRIX_WIDTH  =  16;                                    // Grid size For digital display mode.
// const byte MATRIX_HEIGHT =  16;                                    // Grid size For digital display mode.

#define HET     ColorLeds("Het",     0,   2, MINColor);   
#define IS      ColorLeds("is",      4,   5, SECColor);  ColorLeds("", 8,10, 0); Is = true;
#define WAS     ColorLeds("was",     8,  10, SECColor);  ColorLeds("", 4, 5, 0); Is = false;
#define PRECIES ColorLeds("precies", 17, 23, LetterColor);
#define MTIEN   ColorLeds("tien",    12, 15, LetterColor); 
#define MVIJF   ColorLeds("vijf",    25, 28, LetterColor); 
#define KWART   ColorLeds("kwart",   30, 34, LetterColor);
#define VOOR    ColorLeds("voor",    44, 47, LetterColor);
#define OVER    ColorLeds("over",    38, 41, LetterColor);
#define HALF    ColorLeds("half",    48, 51, LetterColor);
#define MIDDER  ColorLeds("midder",  53, 58, LetterColor);
#define VIJF    ColorLeds("vijf",    66, 69, LetterColor);
#define TWEE    ColorLeds("twee",    60, 63, LetterColor);
#define EEN     ColorLeds("een",     72, 74, LetterColor);
#define VIER    ColorLeds("vier",    77, 80, LetterColor);
#define TIEN    ColorLeds("tien",    91, 94, LetterColor);
#define TWAALF  ColorLeds("twaalf",  84, 89, LetterColor);
#define DRIE    ColorLeds("drie",    96, 99, LetterColor);
#define NEGEN   ColorLeds("negen",  102,106, LetterColor);
#define ACHT    ColorLeds("acht",   114,117, LetterColor);
#define NACHT   ColorLeds("nacht",  114,118, LetterColor);
#define ZES     ColorLeds("zes",    110,112, LetterColor);
#define ZEVEN   ColorLeds("zeven",  121,125, LetterColor);
#define ELF     ColorLeds("elf",    128,130, LetterColor);
#define NOEN    ColorLeds("noen",   139,142, LetterColor);
#define UUR     ColorLeds("uur",    134,136, LetterColor);
#define EDSOFT  ColorLeds("EdSoft", 132,132, LetterColor);
#define X_OFF   ColorLeds("",         0,  2, 0);
#define X_ON    ColorLeds("",         0,  2, LetterColor);
#define NTPT    ColorLed(139, orange);  ColorLed(137, orange);  ColorLed(117, orange);         // NTP
#define RTCT    ColorLed( 22, green);   ColorLed(  2, green);   ColorLed( 20, green);          // RTC
#define BLEONOFF ColorLed( 16, blue);   ColorLed( 81, blue);    ColorLed( 61, blue);           // BLE
                     #endif //NL144CLOCK

                     #ifdef NLM1M2M3M4L114 
const uint32_t NUM_LEDS  =  114;                                                               // How many leds in  strip? + 4 for the minutes
const byte MATRIX_WIDTH  =  11;                                                                // NA Not used in this clock. 10 is fine 
const byte MATRIX_HEIGHT =  10;                                                                // NA Not used in this clock. 10 is fine 
                   
#define HET     ColorLeds("Het",      0,   2, MINColor);                                       // Special adapted clock face
#define IS      ColorLeds("is",       4,   5, SECColor);     Is = true;    //ColorLeds("", 4, 5, 0); 
#define WAS     ColorLeds("was",      4,   5, SECColor);     Is = false;  // ColorLeds("", 4, 5, 0); 
#define MVIJF   ColorLeds("vijf",     7,  10, LetterColor); 
#define MVOOR   ColorLeds("voor",    11,  14, LetterColor);
#define MTIEN   ColorLeds("tien",    18,  21, LetterColor); 
#define OVER    ColorLeds("over",    22,  25, LetterColor);
#define KWART   ColorLeds("kwart",   28,  32, LetterColor);
#define OVER2   ColorLeds("over",    33,  36, LetterColor);
#define HALF    ColorLeds("half",    40,  43, LetterColor);
#define VOOR    ColorLeds("voor",    44,  47, LetterColor);
#define EEN     ColorLeds("een",     51,  53, LetterColor);
#define DRIE    ColorLeds("drie",    55,  58, LetterColor);
#define TWEE    ColorLeds("twee",    62,  65, LetterColor);
#define VIER    ColorLeds("vier",    66,  69, LetterColor);
#define VIJF    ColorLeds("vijf",    70,  73, LetterColor);
#define ZES     ColorLeds("zes",     74,  76, LetterColor);
#define NEGEN   ColorLeds("negen",   77,  81, LetterColor);
#define ZEVEN   ColorLeds("zeven",   83,  87, LetterColor);
#define ACHT    ColorLeds("acht",    88,  91, LetterColor);
#define TIEN    ColorLeds("tien",    92,  95, LetterColor);
#define ELF     ColorLeds("elf",     96,  98, LetterColor);
#define TWAALF  ColorLeds("twaalf", 104, 109, LetterColor);
#define UUR     ColorLeds("uur",     99, 101, LetterColor);
#define MIN1    ColorLeds("M1",     110, 110, LetterColor); 
#define MIN2    ColorLeds("M2",     111, 111, LetterColor);                                   // MINColor); 
#define MIN3    ColorLeds("M3",     112, 112, LetterColor);
#define MIN4    ColorLeds("M4",     113, 113, LetterColor);    
#define NTPT    ColorLed( 96, orange);  ColorLed( 97, orange);  ColorLed( 98, orange);        // NTP
#define RTCT    ColorLed( 22, green);   ColorLed( 23, green);   ColorLed( 24, green);         // RTC
#define BLEONOFF ColorLed( 80, blue);   ColorLed( 81, blue);    ColorLed( 82, blue);          // BLE
                     #endif //NLM1M2M3M4L114

                     #ifdef NLM1M2M3M4L144
const uint32_t NUM_LEDS  =  144;                                    // How many leds in  strip? + 4 for the minutes
const byte MATRIX_WIDTH  =  12;                                    // NA Not used in this clock. 10 is fine 
const byte MATRIX_HEIGHT =  12;                                    // NA Not used in this clock. 10 is fine 
                   
#define HET     ColorLeds("Het",      0,   4, MINColor);           // Special adapted clock face
#define IS      ColorLeds("is",       5,   7, SECColor);     Is = true;    //ColorLeds("", 4, 5, 0); 
#define WAS     ColorLeds("was",      5,   7, SECColor);     Is = false;  // ColorLeds("", 4, 5, 0); 
#define MVIJF   ColorLeds("vijf",     8,  13, LetterColor); 
#define MVOOR   ColorLeds("voor",    14,  19, LetterColor);
#define MTIEN   ColorLeds("tien",    20,  25, LetterColor); 
#define OVER    ColorLeds("over",    26,  31, LetterColor);
#define KWART   ColorLeds("kwart",   32,  39, LetterColor);
#define OVER2   ColorLeds("over",    39,  45, LetterColor);
#define HALF    ColorLeds("half",    46,  51, LetterColor);
#define VOOR    ColorLeds("voor",    52,  57, LetterColor);
#define EEN     ColorLeds("een",     58,  62, LetterColor);
#define DRIE    ColorLeds("drie",    63,  68, LetterColor);
#define TWEE    ColorLeds("twee",    69,  74, LetterColor);
#define VIER    ColorLeds("vier",    75,  80, LetterColor);
#define VIJF    ColorLeds("vijf",    81,  86, LetterColor);
#define ZES     ColorLeds("zes",     87,  91, LetterColor);
#define NEGEN   ColorLeds("negen",   92,  99, LetterColor);
#define ZEVEN   ColorLeds("zeven",  100, 107, LetterColor);
#define ACHT    ColorLeds("acht",   108, 113, LetterColor);
#define TIEN    ColorLeds("tien",   114, 119, LetterColor);
#define ELF     ColorLeds("elf",    120, 124, LetterColor);
#define TWAALF  ColorLeds("twaalf", 130, 139, LetterColor);
#define UUR     ColorLeds("uur",    125, 129, LetterColor);
#define MIN1    ColorLeds("M1",     140, 140, LetterColor); 
#define MIN2    ColorLeds("M2",     141, 141, LetterColor);       //MINColor); 
#define MIN3    ColorLeds("M3",     142, 142, LetterColor);
#define MIN4    ColorLeds("M4",     143, 143, LetterColor);    
#define NTPT    ColorLed(139, orange);  ColorLed(137, orange);  ColorLed(117, orange);         // NTP
#define RTCT    ColorLed( 22, green);   ColorLed(  2, green);   ColorLed( 20, green);          // RTC
#define BLEONOFF ColorLed( 16, blue);   ColorLed( 81, blue);    ColorLed( 61, blue);           // BLE
                     #endif //NLM1M2M3M4L144

                     #ifdef NLM1M2M3M4L256
const uint32_t NUM_LEDS  =  256;                                                              // How many leds in  strip? + 4 for the minutes
const byte MATRIX_WIDTH  =  16;                                                               // NA Not used in this clock. 16 is fine 
const byte MATRIX_HEIGHT =  16;                                                               // NA Not used in this clock. 16 is fine 
                 
